package Day15;

public class Day15_문제3_지하철관제_다른방식 {

	
	/*	[조건1] 역 4개 (종점역 -> 용산 -> 서울 -> 구로 -> 종점역)
	 * 	[조건2] 전철 3개 객체 [종점역에서 3개 전철 대기]
	 *  [조건3] 출발 신호 받아서 해당역에서 출발해서 다음역으로 도착
	 *  [조건4] 역 당 소요시간 2초
	 *  [조건5] queue를 이용하기
	 *  
	 *  출발신호 메뉴
	 *  1. 종점 2. 용산 3. 서울 4. 구로
	 *  
	 *  [예시] 1번 선택시 종점역에 먼저 들어온 전철을 다음역으로 이동
	 *  [예시2] 만일 해당역에 전철이 없으면 없다 출력
	 *  
	 *  [예시]
	 *  -----현 전철역 -----
	 *  종점 : 전철3 전철4
	 *  용산 : 전철2
	 *  서울 : 전철1
	 *  구로 : 전철X
	 */
	
	public static void main(String[] args) {
		
	}
}
